Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E30A.tmx
Source language: en_us
Languages: zh_cn

source: 18 free ways to celebrate Mother's Day
zh_cn: 庆祝母亲节的18个免费方案

source: It's not that Mom doesn't deserve an extravagantly expensive celebration of her day.
zh_cn: 这不是说妈妈们不值得在自己的节日过得奢华点。

source: It's just that over-the-top gifts and parties may not be feasible on a budget.
zh_cn: 这只是考虑到奢侈的礼物和聚会可能在预算上行不通。

source: Image: Family ((C) Corbis)And speaking as a mom, I can say that what matters most to me on Mother's Day isn't the amount of money spent (in fact, I get more of a kick out of saving money, usually).
zh_cn: 作为一个母亲，我认为在母亲节这天对我来说最重要的不是钱花得多少（实际上我通常更喜欢省钱）。

source: What makes Mother's Day special to me is two things: getting a free pass out of normal mom work like laundry, cleaning, cooking and the like, and getting to spend time with my family.
zh_cn: 对我来说有两件事会让母亲节意义特殊：一、从洗衣服、打扫卫生、做饭等等日常家务中脱身。二、花时间和家人聚在一起。

source: Peruse the list below for plenty of ideas that won't cost you but will still make your mom feel special.
zh_cn: 做好下面所列出的，这大量的点子让你不花钱却能让母亲节与众不同。

source: (See also: "Mother's Day gifts that show you really care.")
zh_cn: （注意：准备母亲节礼物会让她感受你的关爱）

source: Give Mom the day off.
zh_cn: 1、给妈妈放一天假。

source: This should be the absolute minimum you do to celebrate Mother's Day, anyway: Give her a day off from all the mundane stuff she does, without complaining, day after day.
zh_cn: 不管怎么样，对你来说，这是庆祝母亲节最简单的方式。在这一天，让她远离那些她任劳任怨、日复一日做着的家务事。

source: Pitch in, get the whole family involved, and do the work for her.
zh_cn: 用心和家人一起为她把这些事做好。

source: Take the kids to the park and give Mom some quiet time.
zh_cn: 2、带孩子去公园给妈妈一些安静时光

source: Listen, I know a mom loves being with her kids but, especially for moms of young kids, having a little peace and quiet time is truly one of the ultimate gifts you can give.
zh_cn: 听着，妈妈喜欢和孩子在一起这一点我是知道的，但是对那些尤其是年轻妈妈来说，拥有一些平静的时光是真的你能给的最好的礼物。

source: Pack up the kids, go to the park for an hour or two, and leave Mom at home to nap, watch a movie in peace, read a book, or do her nails -- whatever she wants.
zh_cn: 收拾好孩子要带的东西，在公园里呆一两个小时，留妈妈一个人在家里，做任何自己想做的事，如打盹、安静地看电影、看一本书或是美化指甲。

source: Make and deliver breakfast in bed.
zh_cn: 3、做一次早餐并送到妈妈床前

source: Yes, it's as cliched as giving Dad a tie for Father's Day, but there's a good reason here.
zh_cn: 虽然这有点像在父亲节给爸爸送条领带那么老套，但是这么做还是有理由的。

source: Moms are usually the ones who hop (or crawl) out of bed and get everybody going in the morning.
zh_cn: 妈妈们总是会在早晨从床上一跃而下，为家里每个人准备好早餐。

source: She deserves a break.
zh_cn: 所以她也需要休息下。

source: Make a nice breakfast, deliver it to her in bed, and let her enjoy a morning off.
zh_cn: 做一顿丰盛的早餐并送到她床前，让她享受这悠闲的早晨。

source: Take the family out for a picnic at the park.
zh_cn: 4、带家人到公园来一次野餐

source: Get in the kitchen and make some sandwiches, pasta salad, or some other portable meal.
zh_cn: 到厨房做些三明治、面条沙拉、或是其他一些可以外带的食物。

source: Gather up all the picnic supplies (try not to ask Mom what you should take).
zh_cn: 带有所有野餐物质（不要去问她应该带什么）。

source: Then whisk everybody away to a local park for a picnic and some play time outdoors.
zh_cn: 然后带家人到当地的一个公园来一次野餐或是做些户外游戏。

source: Take a walk, sit around, talk to people, play volleyball, or go at night and watch the stars.
zh_cn: 如散步、一起围坐着聊聊天、打排球、或是夜晚外出看星星。

source: Mom's choice.
zh_cn: 这就让妈妈自己选。

source: Take a hike.
zh_cn: 5、来一次远足。

source: Picnic optional.
zh_cn: 可以当中来次野餐。

source: Scout out some new scenery in the area, gather up the gear, and take the family on a leisurely (or energetic) hike.
zh_cn: 搜寻下自己所在社区的新景点,收拾好外出的衣服，然后带家人来一次休闲的远足。

source: This is one of my favorite family activities.
zh_cn: 这是我最喜欢的家庭活动之一。

source: I love being outside, and I love especially being outside with my family.
zh_cn: 我喜欢呆在户外，尤其是和家人在一起。

source: Scout your area for free concerts or events.
zh_cn: 6、搜一下自己社区附近有无免费的音乐会或是免费活动

source: Several parks in my area have free concerts over the spring and summer.
zh_cn: 在我居住的地方，春天和夏天里有几个公园会举办免费音乐会。

source: There are also different festivals, farmers markets, plays, walks, and more.
zh_cn: 那里也会有不同节日庆贺、农产品交易、戏剧、集体散步等等许多活动。

source: Search for free local events and music in your area, and take the whole family.
zh_cn: 所以搜索一下你社区周围的一些免费活动或是音乐会，有的话，带家人一起去！

source: Have a surprise party.
zh_cn: 7、办一个惊喜派对

source: Not every mom will want a surprise party on Mother's Day, so be sensitive to what the mom in your life will enjoy.
zh_cn: 母亲节并非每个母亲都会喜欢惊喜派对，你自己要清楚妈妈喜欢什么。

source: I happen to love parties and especially love surprise parties, so the idea of having a surprise party on Mother's Day -- one at which the dads and kids are responsible for all the planning, prepping and cleanup -- sounds insanely fun.
zh_cn: 对于我来说，我恰好喜欢派对，尤其钟爱惊喜派对，所以母亲节来一次这样的派对的主意听起来真是超有意思，而爸爸们和孩子们就负责策划、准备和最后的清理工作。

source: You have to be serious about pulling this off right, though. No fair planning it and then making Mom handle the cleanup.
zh_cn: 然而，你需对此严肃对待，不要单单是策划，到最后还是把清理工作给妈妈。

source: Do it all.
zh_cn: 自己包揽全部事务，切记！

source: Tackle a project together.
zh_cn: 8、共同解决一个项目

source: My mother-in-law has a longstanding request for Mother's Day. She wants her "boys" to come over and help out with whatever current project is at hand.
zh_cn: 在母亲节，我婆婆一直有个要求，不管手头正忙着什么事，她总想让家里的男孩们过来一起帮忙解决。

source: We usually plan a casual lunch together sometime on Mother's Day weekend, then my father-in-law and the three grown-up boys go finish up the project while we girls either sit inside and corral the kids or go outside and cheer the men on.
zh_cn: 我们通常会在母亲节周末的特定时间一起吃个休闲午餐。然后我公公会和三个成年的男孩一起完成一个项目。然而我们女孩要么呆在屋内和孩子玩，要么在屋外为他们打气加油。

source: It's a no-cost, fun and productive celebration.
zh_cn: 这是个零花费，却又是有趣而富有成效的庆祝方式。

source: Have a family movie night.
zh_cn: 9、来一次家庭电影之夜

source: Family time is important for most moms, and finding time to do things together gets more and more difficult as kids get older and have their own social circles, jobs and events.
zh_cn: 绝大多数妈妈们都很看重家庭时光，但是随着孩子渐渐长大有了自己的社交圈、工作和自己活动，找时间一起做事变得尤为困难。

source: So dedicate Mother's Day night to a special family movie night.
zh_cn: 这是次很好的机会，在母亲节夜晚来次家庭电影聚会。

source: Mom gets to pick the movies. Dad and kids provide meal and/or movie-appropriate snacks, and everyone gets to settle in for some chill time together.
zh_cn: 妈妈们负责挑选电影，爸爸和孩子就负责饮食及看电影的零食。然后大家一起安静地享受在一起的时光。

source: Make a memory book.
zh_cn: 10、制作一本纪念册

source: For the creatively minded, or for scrapbooking moms in general, having the whole family sit down for a couple of hours to put together a family memory book could be the perfect no-cost gift.
zh_cn: 对那些具有创意或是普遍喜欢摆弄剪贴簿的妈妈来说，全家一起坐下来花几个小时制作一部家庭纪念册，这绝对是一份零花费的完美礼物。

source: Gather supplies you already have: an empty photo album, pretty papers, stickers, photos and the like.
zh_cn: 准备几样东西：一本空的相册、漂亮的纸张、胶水、照片等类似的东西。

source: Put an hour or two into it, and have (or help) each family member create a page individually and then put them in the book, or work on each page as a team.
zh_cn: 花一两个小时，让每个家庭成员独立制作一页，然后将其组合起来，或者也可以大家集体制作一页。

source: Create a treasure hunt for Mom.
zh_cn: 11、为妈妈设计一次寻宝之旅

source: Kids aren't the only ones who like treasure hunts.
zh_cn: 不是单单只有孩子喜欢寻宝游戏。

source: Put some time into thinking up fun clues, then hide little treats or coupons for stuff Mom will like (such as "a night out" or "you get to pick the movie, and no one complains") and let her discover them.
zh_cn: 花点时间想一些有趣的寻宝线路，然后把小的邀请单子或是优惠券这类妈妈喜欢的东西藏好（类似“邀请你夜晚外出”或是“请你看电影，随便挑没事”）。

source: Follow along with a camera.
zh_cn: 在她找的过程中最好全程录像。

source: Set up a girls' night in for Mom.
zh_cn: 12、为妈妈办个姐妹之夜

source: If Mom hasn't had a chance to get together with girlfriends lately, why not make Mother's Day evening a special time for that?
zh_cn: 如果妈妈最近没机会和她的姐妹们相聚，为什么不好好利用这次母亲节机会呢？

source: Invite a few of her best friends over, then get out of the way.
zh_cn: 把她一些最好的朋友请过来，然后单独为她们创造些空间。

source: Out of the house, actually, would probably be best.
zh_cn: 自己不要呆在家里是最好的选择。

source: Let them talk, relax and enjoy some kid-free and spouse-free time together.
zh_cn: 让她们彼此放松自如地聊天，享受这段独身时光。

source: Take a family bike ride.
zh_cn: 13、全家一起骑车出游

source: This is a great way to both kick off the summer season of great outdoor family adventures and to celebrate Mother's Day, so get the bikes out of the garage and into shape, find a nearby trail, and head out for a family bike ride.
zh_cn: 这是个很好的方式，既揭开了家庭夏日户外冒险之旅又可以庆祝母亲节。把车子从车库里拿出来然后整一下，找条附近的小路，开始家庭骑车之旅。

source: It's a good way to work off that fabulous lunch you made for Mom, anyway.
zh_cn: 此外，这也是个很好的方式来消化你为妈妈做的美味午餐。

source: Visit a free local attraction.
zh_cn: 14、游览本地的一个免费景点

source: We often forget to be like tourists in our own towns.
zh_cn: 有时我们常常忘记去游览本地的一些景点。

source: Here in my city, there's an award-winning free zoo, a free art museum, and a free history museum, plus many parks, nature reserves and historical sites.
zh_cn: 我所在的城市，有一个获过奖的免费公园，一个免费艺术博物馆和一个免费历史博物馆，外加许多公园、自然保护区和历史名胜。

source: Take the day to visit some you haven't seen before.
zh_cn: 在这一天去游览些你没玩过的地方。

source: Have a family pajama party.
zh_cn: 15、举办一次家庭睡衣派对

source: Have everybody get comfy, throw on some fun music, and cook up breakfast for dinner while Mom gets to relax.
zh_cn: 在美妙的音乐氛围下，大家穿着睡衣舒舒服服的，晚餐就把早餐剩下的热一下正好也让妈妈休息下。

source: Eat a leisurely meal, talk about family plans, and play a few games.
zh_cn: 大家悠闲地吃吃饭、谈谈家庭计划同时再玩几个游戏。

source: Then tuck the kids into bed so Mom and Dad can continue the pajama party in their own room.
zh_cn: 然后让孩子上床睡觉，这样爸爸妈妈还可以在他们的房间继续睡衣派对。

source: Create a new tradition.
zh_cn: 16、创一个新的家庭传统

source: Traditions help us create memories and give us touchstones as a family, common points of connection we can come back to even as we grow up, move away, pursue different dreams.
zh_cn: 传统给我们留下记忆同时也是家庭的试金石，即使当我们长大了、离家了、在追逐不同的梦想时，因着传统我们回到彼此维系的共同点。

source: Use Mother's Day to come up with a new family tradition, then make it something you repeat at significant times.
zh_cn: 在母亲节这天想一个新的家庭传统，并在重要的时期保持这个传统。

source: It could be as simple as saying a family prayer or taking a family photo.
zh_cn: 其实它可以很简单,例如：一个家庭祷告或是照全家福。

source: Volunteer together.
zh_cn: 17、一起做义工

source: Does Mom have a special cause she's passionate about? Volunteer your time as a family and find a way to give back together.
zh_cn: 妈妈有特别热衷的事吗？全家一起贡献点时间，一起做义工来回馈社会。

source: Spending a few hours together while helping others will be a gift to Mom, and will benefit you as a family as you build closer relationships and learn to appreciate your blessings.
zh_cn: 大家花几个小时帮助别人是对妈妈的一次馈赠，这不仅有益于家庭成员间建立更亲密关系，而且可以学习感恩的功课。

source: Plan a group outing.
zh_cn: 18、策划一次集体外出

source: If Mom is a social creature, then expand the family outing into a group outing.
zh_cn: 如果妈妈喜欢社交，可以把家庭外出扩展为集体外出。

source: One of the things Mom is often responsible for is planning the social events, so take over that role and let her just enjoy the interaction.
zh_cn: 妈妈经常要负责的事情中就包含策划社交活动，所以这次你就接过棒子，让妈妈享受这个过程。

source: You can organize a picnic in the park, a group hike or bike ride, or meet up with friends for one of those free local events.
zh_cn: 你可以在公园里组织一次野餐、集体远足、骑车出游、或是在当地的免费活动中来一次朋友聚会。

source: Then cough up the money for some ice cream afterward.
zh_cn: 最后还可以花点钱买点冰激凌给大家。
